# Открытый студенческий конкурс (хакатон) по быстрому прототипированию решений Интернета вещей с применением интерфеса "Мозг-компьютер"


##Содержание

- [Аннотация](#0)
- [1. Введение](#1)
	- [1.1. Инфраструктура типового решения IoT](#11)
	- [1.2. Интерфейс "мозг-компьютер" на основе вызванной волны P300](#12)
		- [1.2.1. Интерфейсы на основе мю-ритма](#121)
		- [1.2.2. Интерфейсы на основе альфа-ритма](#122)
		- [1.2.3. Интерфейсы на основе SSVEP и айтрекинг](#123)
		- [1.2.4. Интерфейсы, использующие P300](#124)
		- [1.2.5. Дополнительная литература](#125)
	- [1.3. Протокол MQTT](#13)
	- [1.4. Облачная платформа *Bluemix*](#14)
	- [1.5. Краткое описание концепций *Bluemix*](#15)
		- [1.5.1. Развертывание и управление приложением](#151)
		- [1.5.2. Сервисы DevOps Services для *Bluemix*](#152)
		- [1.5.3. Среда визуальной разработки JavaScript приложений Node-RED](#153)
		- [1.5.4. Терминология Node-RED](#154)
		- [1.5.5. Пример использования Node-RED](#155)
	- [Принцип действия электроэнцефалографа](#2)
		- [//ToDo](#21)
- [//ToDo Нейронные сети](#3)
	- [//ToDo](#31)
	- [//ToDo](#32)
	- [//ToDo](#33)
- [Raspberry Pi](#4)
	- [Описание](#41)
		- [Порты и аппаратные интерфейсы](#411)
		- [Распиновка платы](#412)
		- [Питание](#413)
	- [Разбор тестового примера:](#42) 
	- [Настройка SSH соединения с Raspberry Pi](#43)
	- [Как узнать адрес Raspberry?](#44)
	- [Полезные команды для работы в ОС Raspbian](#45)
	- [Программирование](#46)
	- [//ToDo Подключение электроэнцефалографа к Raspberry](#47)
	- [//ToDo Взаимодействие с ЭЭГ на Raspberry](#48)
		- [//ToDo](#481)
		- [//ToDo](#482)
		- [//ToDo](#483)
- [Работа с IBM Bluemix](#5)
	- [Регистрация в Bluemix](#51)
	- [Создание приложения Node.js](#52)
	- [Подключение сервиса Watson IOT](#53)
	- [Принципы обмена MQTT-сообщениями в Bluemix и создание MQTT Device и MQTT API key](#54)
	- [Описание подключения к MQTT брокеру и проверка передачи MQTT сообщений с помощью MQTTlens](#55)
	- [//ToDo Визуализация данных ЭЭГ](#56)
- [//ToDo Тренажер управления инвалидной коляской](#6)
	- [//ToDo](#61)
	- [//ToDo](#62)
	- [//ToDo](#63)
- [//ToDo Основной алгоритм управления системой и тестирование проекта ИМК](#7)
	- [//ToDo](#71)
	- [//ToDo](#72)
	- [//ToDo](#73)
- [Описание оборудования лаборатории Интернета вещей](#50)
# Аннотация <a name="0"></a>

> Всем участникам соревнования предоставляется необходимое оборудование для реализации прототипа решения Интернета вещей и интерфеса мозг-компьютер: цифровой электроэнцефалограф, микрокомпьютеры, средства сопряжения. 

> В ходе соревнования типовой проект может быть использован для построения широкого спектра решений: 

> - в медицине; 

> - на отвтсвенном производстве; 

> - в бытовых условиях; 

> - транспорте и других областях.

> Задача для участников соревнования ставится следующим образом: **используя имеющийся набор сбора электроэнефалограммы головного мозга, микрокомпьютеры, облачные сервисы и приложения, разработать прототип распределенной системы Интернета вещей на основе ИМК.** 

> Допускается применение иных облачных платформ и аппаратно-программных решений. Прототип системы будет собран на специальном стенде в лаборатории IoT МГТУ им. Баумана, где он может быть продемонстрирован жюри. 



